{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_inputs"}, "name": "encoder_inputs", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "encoder_embedding", "trainable": true, "batch_input_shape": [null, 14], "dtype": "float32", "input_dim": 1379, "output_dim": 188, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 14}, "name": "encoder_embedding", "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 2485], "dtype": "float32", "sparse": false, "ragged": false, "name": "decoder_inputs"}, "name": "decoder_inputs", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "encoder_lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 188, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 4}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 5}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 6}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "encoder_lstm", "inbound_nodes": [[["encoder_embedding", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "decoder_lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 188, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "decoder_lstm", "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]]}, {"class_name": "Attention", "config": {"name": "attention_layer", "trainable": true, "dtype": "float32", "causal": false, "dropout": 0.0, "use_scale": false}, "name": "attention_layer", "inbound_nodes": [[["decoder_lstm", 0, 0, {}], ["encoder_lstm", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concat_layer", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concat_layer", "inbound_nodes": [[["decoder_lstm", 0, 0, {}], ["attention_layer", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "decoder_dense", "trainable": true, "dtype": "float32", "units": 2485, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "decoder_dense", "inbound_nodes": [[["concat_layer", 0, 0, {}]]]}], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "output_layers": [["decoder_dense", 0, 0]]}, "keras_version": "2.8.0", "backend": "tensorflow"}